<a href="https://colab.research.google.com/github/SainiManisha/dbms-tutorial/blob/master/Connect_to_GCP_MySQL_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading https://files.pythonhosted.org/packages/ce/1d/378f92f45fb98d7e033f6a94b0600b8ae496e67ba411b992f536784a3d0d/mysql_connector_python-8.0.21-cp36-cp36m-manylinux1_x86_64.whl (15.8MB)
     |████████████████████████████████| 15.8MB 292kB/s
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.6/dist-packages (from mysql-connector-python) (3.12.4)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (49.6.0)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.21

In [9]:
import mysql.connector

In [10]:
conn = mysql.connector.connect(
  host="34.93.147.110",
  user="root",
  password="123456789",
  port=3306,
  database='manisha'
)

print(conn)

<mysql.connector.connection_cext.CMySQLConnection object at 0x7f50eff3cc50>

In [11]:
cur = conn.cursor()

In [12]:
import pandas as pd

In [15]:
cur.execute("""Create table trycommands
        (id int(10) Primary key, name text)""")

In [16]:
query = """INSERT INTO trycommands (id, name) VALUES
            (1, "Student A"),
            (2, "Student B")"""
cur.execute(query)

In [17]:
pd.read_sql("SELECT * FROM trycommands", conn)

   id       name
0   1  Student A
1   2  Student B

In [18]:
query = """INSERT INTO trycommands (id, name) VALUES
(3, "Student C"),
(4, "Student D")"""
cur.execute(query)

In [19]:
pd.read_sql("SELECT * FROM trycommands", conn)

   id       name
0   1  Student A
1   2  Student B
2   3  Student C
3   4  Student D

In [20]:
cur.execute("DROP TABLE trycommands")